web/app/views/layouts/sp.html.erb

                        </li>
                        <% @profil = Oadm.where(id: session[:oadm_id]).first %>
---
SELECT "oadms".* FROM "oadms" WHERE "oadms"."id" = $1 ORDER BY "oadms"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

                <aside class="app-sidebar">
                    <% @profil = Oadm.where(id: session[:oadm_id]).first %>
---
SELECT "oadms".* FROM "oadms" WHERE "oadms"."id" = $1 ORDER BY "oadms"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]