web/app/views/layouts/nav/_public.html.erb

SELECT "pesertaas".* FROM "pesertaas" WHERE "pesertaas"."id" = $1 ORDER BY "pesertaas"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                            </li>
                            <% @profil = Pesertaa.where(id: session[:pesertaa_id]).first %>