web/app/controllers/sp/auth_controller.rb

  def daftar_post
    @nama             = params[:oadm_nama]
    @email            = params[:oadm_email].delete(' ').downcase
    @telepon          = params[:oadm_telepon]
    @password         = params[:oadm_password]
    @password_confirm = params[:password_confirm]
    @pass             = BCrypt::Password.create(@password)

    @hasil_akhir = ''

    if @password == @password_confirm

      if @password.length >= 8

        if Oadm.where(oadm_email: @email).count == 0

          @ora                    = Oadm.new
          @ora.oadm_nama          = @nama
          @ora.oadm_email         = @email
          @ora.oadm_telepon       = @telepon
          @ora.oadm_password      = @pass
          @ora.oadm_status        = 'inactive'
          @ora.save
---
INSERT INTO "oadms" ("created_at", "updated_at", "oadm_email", "oadm_password", "oadm_status", "oadm_nama", "oadm_telepon") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT COUNT(*) FROM "oadms" WHERE "oadms"."oadm_email" = $1  [["oadm_email", "rehanfikri98@gmail.com"]]

  def masuk_post
    @email    = params[:oadm_email]
    @password = params[:oadm_password]

    @admin = Oadm.find_by(oadm_email: @email)
---
SELECT "oadms".* FROM "oadms" WHERE "oadms"."oadm_email" = $1 LIMIT $2  [["oadm_email", "rehanfikri98@gmail.com"], ["LIMIT", 1]]