web/app/controllers/sp/guru_controller.rb

SELECT "gurus".* FROM "gurus"
---
  def index
    @datas = Guru.all

INSERT INTO "gurus" ("guru_nama", "guru_tgl_lahir", "guru_tempat_lahir", "guru_jk", "guru_status_kepegawaian", "guru_alamat", "guru_telepon", "guru_email", "guru_bidang_studi", "guru_pendidikan_terakhir", "guru_agama", "guru_status_perkawinan", "guru_photo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def baru_post

      guru = params[:guru]

      Guru.create({
        guru_nama: guru[:guru_nama],
        guru_tgl_lahir: guru[:guru_tgl_lahir],
        guru_tempat_lahir: guru[:guru_tempat_lahir],
        guru_jk: guru[:guru_jk],
        guru_status_kepegawaian: guru[:guru_status_kepegawaian],
        guru_telepon: guru[:guru_telepon],
        guru_alamat: guru[:guru_alamat],
        guru_email: guru[:guru_email],
        guru_bidang_studi: guru[:guru_bidang_studi],
        guru_pendidikan_terakhir: guru[:guru_pendidikan_terakhir],
        guru_agama: guru[:guru_agama],
        guru_status_perkawinan: guru[:guru_status_perkawinan],
        guru_photo: guru[:guru_photo]


      })

SELECT "gurus".* FROM "gurus" WHERE "gurus"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
   def edit
       guru_id = params[:guru_id].to_i
       @data = Guru.find(guru_id)

SELECT "gurus".* FROM "gurus" WHERE "gurus"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gurus" SET "guru_photo" = $1, "updated_at" = $2 WHERE "gurus"."id" = $3  [["guru_photo", "luffy.jpg"], ["updated_at", "2021-01-14 07:46:06.351472"], ["id", 1]]
---
   def edit_post
       guru = params[:guru]
       @data = Guru.find(params[:guru_id])
       @data.guru_nama = guru[:guru_nama]
       @data.guru_tgl_lahir = guru[:guru_tgl_lahir]
       @data.guru_tempat_lahir = guru[:guru_tempat_lahir]
       @data.guru_jk = guru[:guru_jk]
       @data.guru_alamat = guru[:guru_alamat]
       @data.guru_status_kepegawaian = guru[:guru_status_kepegawaian]
       @data.guru_telepon = guru[:guru_telepon]
       @data.guru_email = guru[:guru_email]
       @data.guru_bidang_studi = guru[:guru_bidang_studi]
       @data.guru_pendidikan_terakhir = guru[:guru_pendidikan_terakhir]
       @data.guru_agama = guru[:guru_agama]
       @data.guru_status_perkawinan = guru[:guru_status_perkawinan]
       @data.guru_photo = guru[:guru_photo]
       if @data.save

SELECT "gurus".* FROM "gurus" WHERE "gurus"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
   def view
     guru = params[:guru]
     @data = Guru.find(params[:guru_id])