web/app/controllers/sp/peserta_controller.rb

SELECT "pesertaas".* FROM "pesertaas"
---
  def index
    @datas = Pesertaa.all

SELECT "pesertaas".* FROM "pesertaas" WHERE "pesertaas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
   def view
     pesertaa = params[:pesertaa]
     @data = Pesertaa.find(params[:pesertaa_id])