web/app/controllers/sp/user_controller.rb

  def index
    @datas = Oadm.all
---
SELECT "oadms".* FROM "oadms"