web/app/controllers/public/auth2_controller.rb

      def daftar_post
        # @email            = params[:pesertaa_email].delete(' ').downcase
        @email            = params[:pesertaa_email]
        @password         = params[:pesertaa_password]
        @password_confirm = params[:password_confirm]
        @pass             = BCrypt::Password.create(@password)

        @hasil_akhir = ''

        if @password == @password_confirm

          if @password.length >= 8

            if Pesertaa.where(pesertaa_email: @email).count == 0

              @ora                    = Pesertaa.new
              @ora.pesertaa_email         = @email
              @ora.pesertaa_password      = @pass
              # @ora.orang_status        = 'inactive'
              @ora.save
---
INSERT INTO "pesertaas" ("pesertaa_password", "pesertaa_email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT COUNT(*) FROM "pesertaas" WHERE "pesertaas"."pesertaa_email" = $1  [["pesertaa_email", "rehanfikri98@gmail.com"]]

      def masuk_post
        @email = params[:pesertaa_email]
        @password = params[:pesertaa_password]

        @peserta = Pesertaa.find_by(pesertaa_email: @email)
---
SELECT "pesertaas".* FROM "pesertaas" WHERE "pesertaas"."pesertaa_email" = $1 LIMIT $2  [["pesertaa_email", "rehanfikri98@gmail.com"], ["LIMIT", 1]]