web/app/controllers/public/peserta_controller.rb

SELECT "pesertaas".* FROM "pesertaas" WHERE "pesertaas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    pesertaa = params[:pesertaa_id]
    @data = Pesertaa.find_by(id: session[:pesertaa_id])

SELECT "pesertaas".* FROM "pesertaas" WHERE "pesertaas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
      pesertaa_id = params[:pesertaa_id].to_i
      @data = Pesertaa.find_by(id: session[:pesertaa_id])