web/app/controllers/public/public_controller.rb

  def guru
    @gurus = Guru.latest
---
SELECT "gurus".* FROM "gurus" ORDER BY "gurus"."created_at" DESC

  def staff
    @stafs = Staf.all
---
SELECT "stafs".* FROM "stafs"

  def pengumuman
    @infos = Info.all
---
SELECT "infos".* FROM "infos"